app/controllers/posts_controller.rb

   def show

      @post = Post.find(params[:id])
      @post_attachments = @post.post_attachments.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."post_id" = ?  [["post_id", 1]]

   def create
     @post = current_user.posts.new(post_params)
     if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 02 Sep 2015 07:57:05 UTC +00:00], ["description", "hg"], ["title", "deepti"], ["updated_at", Wed, 02 Sep 2015 07:57:05 UTC +00:00], ["user_id", 1]]

    def update

     @post = Post.find(params[:id])


        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 83  [["description", "hyjusw"], ["updated_at", Mon, 07 Sep 2015 05:25:56 UTC +00:00]]