app/controllers/post_attachments_controller.rb

SELECT "post_attachments".* FROM "post_attachments"
---
  def index

    @post_attachments = PostAttachment.all

SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @post_attachment= PostAttachment.find(params[:id])

SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @post_attachment= PostAttachment.find(params[:id])

INSERT INTO "post_attachments" ("avatar", "created_at", "updated_at") VALUES (?, ?, ?)  [["avatar", "DSC09973.JPG"], ["created_at", Wed, 02 Sep 2015 09:36:40 UTC +00:00], ["updated_at", Wed, 02 Sep 2015 09:36:40 UTC +00:00]]
---
 def create
    @post_attachment = PostAttachment.new(post_attachment_params)

    respond_to do |format|
      if @post_attachment.save

SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "post_attachments" SET "avatar" = ?, "updated_at" = ? WHERE "post_attachments"."id" = 1  [["avatar", "2013-12-07_14.55.52-1.jpg"], ["updated_at", Wed, 02 Sep 2015 08:46:51 UTC +00:00]]
---
 def update
   @post_attachment= PostAttachment.find(params[:id])
  respond_to do |format|
    if @post_attachment.update(post_attachment_params)

SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."id" = ? LIMIT 1  [["id", "22"]]
DELETE FROM "post_attachments" WHERE "post_attachments"."id" = ?  [["id", 22]]
---
  def destroy
      @post_attachment= PostAttachment.find(params[:id])
       @post_attachment.destroy